src/toir_cf/src/Catalogs/торо_ВидыСкользящихПланов/торо_ВидыСкользящихПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВидыСкользящихПланов</name>
  <predefined>
    <items>
      <name>Годовой</name>
      <description>Годовой</description>
    </items>
    <items>
      <name>Долгосрочный</name>
      <description>Долгосрочный</description>
    </items>
    <items>
      <name>Оперативный</name>
      <description>Оперативный</description>
    </items>
    <items>
      <name>Среднесрочный</name>
      <description>Среднесрочный</description>
    </items>
    <items>
      <name>Стратегический</name>
      <description>Стратегический</description>
    </items>
  </predefined>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоОтображаемыхПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьПланирования</name>
    <type>
      <types>EnumRef.торо_ДетализацияПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсполнителяРабот</name>
    <type>
      <types>EnumRef.торо_ДетализацияИсполнителя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРемонтов</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_ВидыСкользящихПланов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ТекстСообщения = НСтр("ru = 'Создание новых элементов справочника недоступно.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли; 
	
	Если ИмяПредопределенныхДанных = "Стратегический" Тогда
		Приоритет = 1;
	ИначеЕсли ИмяПредопределенныхДанных = "Долгосрочный" Тогда 
		Приоритет = 2;
	ИначеЕсли ИмяПредопределенныхДанных = "Годовой" Тогда
		Приоритет = 3;
	ИначеЕсли ИмяПредопределенныхДанных = "Среднесрочный" Тогда
		Приоритет = 4;
	ИначеЕсли ИмяПредопределенныхДанных = "Оперативный" Тогда
	    Приоритет = 5;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Строка Из ВидыРемонтов Цикл
		МассивИмеющихся = ВидыРемонтов.НайтиСтроки(Новый Структура("ВидРемонта", Строка.ВидРемонта));
		Если МассивИмеющихся.Количество() > 1 Тогда
			ТекстСообщения = НСтр("ru = 'В табличной части <Виды ремонтов> имеются дублирующиеся виды ремонтов'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Прервать;
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры
	
#КонецОбласти
 
#КонецЕсли
